error.project.not.found=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u958b\u304b\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u9069\u5207\u306a\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f\u304b\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u65b0\u898f\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.not.digit={0}\u306b\u306f\u6570\u5024\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.file_notfound=\u8aad\u8fbc\u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
error.poi.exception=\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u8fbc\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30d5\u30a1\u30a4\u30eb\u5f62\u5f0f\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u8a73\u7d30\u306a\u30a8\u30e9\u30e1\u30c3\u30bb\u30fc\u30b8:{0}
error.inputfile_required=\u8aad\u8fbc\u3080\u30d5\u30a1\u30a4\u30eb\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.required={0}\u306f\u5fc5\u9808\u3067\u3059\u3002
error.usesheetname_or_advancesetting=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306e\u8ad6\u7406\u540d\u3092\u3069\u306e\u3088\u3046\u306b\u53d6\u5f97\u3059\u308b\u304b\u3001"\u30b7\u30fc\u30c8\u540d\u3092\u8ad6\u7406\u540d\u3068\u3057\u3066\u5229\u7528\u3059\u308b"\u304b"\u8ad6\u7406\u540d\u3001\u7269\u7406\u540d\u3092\u53d6\u5f97\u3059\u308b\u884c\u3068\u5217\u3092\u8a2d\u5b9a\u3059\u308b"\u306e\u3069\u3061\u3089\u304b\u3067\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.not_found_sheet=\u6307\u5b9a\u3055\u308c\u305f\u30b7\u30fc\u30c8\u3001\u3082\u3057\u304f\u306f\u30b7\u30fc\u30c8\u304c1\u3064\u3082\u5b58\u5728\u3057\u307e\u305b\u3093\u3002

result.dialog.title=ER\u30e2\u30c7\u30eb\u306e\u30a4\u30f3\u30dd\u30fc\u30c8
result.dialog.normal=<html><body>{0}\u4ef6\u306e\u30c7\u30fc\u30bf\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3057\u305f\u3002<br/><br/>\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30c7\u30fc\u30bf\u306e\u8a73\u7d30\u306f\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb<br/>$USER_HOME/.astah/professional/excel2er.log\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002</body></html>
result.dialog.normal_with_error=<html><body>{0}\u4ef6\u306e\u30c7\u30fc\u30bf\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3057\u305f\u304c\u3001\u3044\u304f\u3064\u304b\u306e\u30c7\u30fc\u30bf\u306f\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u305f\u70ba\u3001\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002<br/><br/>\u8a73\u7d30\u306f\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb $USER_HOME/.astah/professional/excel2er.log\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002</body></html>
result.dialog.error=<html><body>\u30a4\u30f3\u30dd\u30fc\u30c8\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002<br/>\u8a73\u7d30\u306f\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb($USER_HOME/.astah/professional/excel2er.log)\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002</body></html>

#log
log.create_entity={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
log.create_domain={0}\u30c9\u30e1\u30a4\u30f3\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
log.create_entity_end={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u3092\u4f5c\u6210\u3057\u307e\u3057\u305f\u3002
log.create_domain_end={0}\u30c9\u30e1\u30a4\u30f3\u3092\u4f5c\u6210\u3057\u307e\u3057\u305f\u3002
log.error.create_entity_end={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u3092\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u305f\u305f\u3081\u3001{0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306e\u4f5c\u6210\u3092\u30b9\u30ad\u30c3\u30d7\u3057\u307e\u3059\u3002
log.error.create_domain_end={0}\u30c9\u30e1\u30a4\u30f3\u3092\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u305f\u305f\u3081\u3001{0}\u30c9\u30e1\u30a4\u30f3\u306e\u4f5c\u6210\u3092\u30b9\u30ad\u30c3\u30d7\u3057\u307e\u3059\u3002
log.error.create_entity={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\n\u8a73\u7d30\u306a\u30a8\u30e9\u30fc:{1}
log.error.create_domain={0}\u30c9\u30e1\u30a4\u30f3\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\n\u8a73\u7d30\u306a\u30a8\u30e9\u30fc:{1}
log.error.create_attribute.missing_datatype={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306e{1}\u5c5e\u6027\u3092\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u5c5e\u6027\u306e\u30c7\u30fc\u30bf\u578b\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u3001\u3082\u3057\u304f\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
log.error.create_domain.missing_datatype={0}\u30c9\u30e1\u30a4\u30f3\u3092\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30c7\u30fc\u30bf\u578b\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u3001\u3082\u3057\u304f\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
log.create_attribute={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306b\u5c5e\u6027{1}\u3092\u4f5c\u6210\u3057\u307e\u3059
log.create_attribute_using_domain={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u306b\u5c5e\u6027{1}\u3092{2}\u30c9\u30e1\u30a4\u30f3\u3092\u7528\u3044\u3066\u4f5c\u6210\u3057\u307e\u3059
log.error.create_entity.parameter_error={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u4f5c\u6210\u4e2d\u306b\u3001\u4f5c\u6210\u3059\u308b\u30e2\u30c7\u30eb\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
log.error.create_entity.duplicate_entity={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u91cd\u8907\u3059\u308b\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u3001\u3082\u3057\u304f\u306f\u5c5e\u6027\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
log.error.create_entity.invalideditingexception={0}\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u305fExcel\u4e0a\u306e\u60c5\u5831\u304c\u4e0d\u6b63\u306a\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u30ad\u30fc:{1}
log.error.create_domain.parameter_error={0}\u30c9\u30e1\u30a4\u30f3\u4f5c\u6210\u4e2d\u306b\u3001\u4f5c\u6210\u3059\u308b\u30e2\u30c7\u30eb\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
log.error.create_domain.duplicate_entity={0}\u30c9\u30e1\u30a4\u30f3\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u91cd\u8907\u3059\u308b\u30c9\u30e1\u30a4\u30f3\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
log.error.create_domain.invalideditingexception={0}\u30c9\u30e1\u30a4\u30f3\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u305fExcel\u4e0a\u306e\u60c5\u5831\u304c\u4e0d\u6b63\u306a\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u30ad\u30fc:{1}

#ImportERDomainDialog
dialog.erdomain.title=Excel\u304b\u3089ER\u30c9\u30e1\u30a4\u30f3\u30e2\u30c7\u30eb\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b

#DomainPanle
explain_domain=\u30c9\u30e1\u30a4\u30f3
item_logical_domain=\u8ad6\u7406\u540d
item_physical_domain=\u7269\u7406\u540d
item_datatype_domain=\u30c7\u30fc\u30bf\u578b
item_definition_domain=\u5b9a\u7fa9

#ImportDialog
dialog.title=Excel\u304b\u3089ER\u30e2\u30c7\u30eb\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b
explain_input_file=\u8aad\u307f\u8fbc\u3080\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044
input_file=\u8aad\u8fbc\u30d5\u30a1\u30a4\u30eb
reference_button=\u53c2\u7167
import=\u30a4\u30f3\u30dd\u30fc\u30c8
cancel=\u30ad\u30e3\u30f3\u30bb\u30eb

#Entity Panel
explain_entity=\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3
use_sheetname=\u30b7\u30fc\u30c8\u540d\u3092\u8ad6\u7406\u540d\u3068\u3057\u3066\u5229\u7528\u3059\u308b
advance_setting=\u8ad6\u7406\u540d\u3001\u7269\u7406\u540d\u3092\u53d6\u5f97\u3059\u308b\u884c\u3068\u5217\u3092\u8a2d\u5b9a\u3059\u308b
entity.logicalname=\u8ad6\u7406\u540d
entity.physicalname=\u7269\u7406\u540d
row=\u884c
col=\u5217
entity.logicalname.row=\u8ad6\u7406\u540d \u884c
entity.logicalname.col=\u8ad6\u7406\u540d \u5217
entity.physicalname.row=\u7269\u7406\u540d \u884c
entity.physicalname.col=\u7269\u7406\u540d \u5217

#ERAttribute Panel
explain_attribute=\u5c5e\u6027
start_row=\u30c7\u30fc\u30bf\u306e\u53d6\u8fbc\u958b\u59cb\u884c
item_name=\u9805\u76ee\u540d
item_logical=\u8ad6\u7406\u540d
item_physical=\u7269\u7406\u540d
item_primarykey=Primary Key
item_notnull=NOT NULL
item_defaultvalue=\u521d\u671f\u5024
item_datatype=\u30c7\u30fc\u30bf\u578b
item_length=\u9577\u3055(\u7cbe\u5ea6)
item_definition=\u5b9a\u7fa9
